from django.db import models  # Импортируем базовые инструменты Django для создания таблиц и колонок в базе данных


class PizzaShopModel(models.Model):  # Создаем класс-шаблон для пиццерии. Он наследуется от стандартного models.Model (обрати внимание, здесь нет созданной нами BaseModel)
    class Meta:  # Специальный внутренний класс для настроек самой таблицы
        db_table = 'pizza_shop'  # Указываем, что в базе данных эта таблица должна строго называться 'pizza_shop'

    name = models.CharField(max_length=100)  # Создаем колонку для названия пиццерии (текстовое поле с ограничением в 100 символов)