from django.core.exceptions import ValidationError  # Импортируем класс ошибки для случаев, когда переданы неверные данные
from django.http import QueryDict  # Импортируем тип данных, в котором Django хранит параметры из URL

from apps.pizza.models import PizzaModel  # Импортируем нашу модель пиццы, чтобы взаимодействовать с базой данных

def filter_pizza(query: QueryDict)-> QueryDict:  # Создаем функцию фильтра, которая принимает параметры из запроса
    qs = PizzaModel.objects.all()  # Делаем запрос к БД: получаем все пиццы

    for k, v, in query.items():  # Запускаем цикл по всем переданным параметрам (k - название фильтра, v - его значение)
        match k:  # Проверяем название параметра
            case 'price_gt':  # Если параметр называется 'price_gt' (цена больше)
                qs = qs.filter(price__gt=v)  # Оставляем в списке только те пиццы, цена которых строго больше значения v
            case 'price_lt':  # Если параметр называется 'price_lt' (цена меньше)
                qs = qs.filter(price__lt=v)  # Оставляем в списке только те пиццы, цена которых строго меньше значения v
            case _:  # Во всех остальных случаях (если передали неизвестный параметр)
                raise ValidationError({'detail':f'"{k}" not allowed'})  # Вызываем ошибку валидации и прерываем работу, сообщая, что параметр запрещен

    return qs  # Возвращаем итоговый отфильтрованный список пицц (QuerySet), готовый к отправке пользователю